; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v12 ?v4)
             (pred_1 ?v11 ?v3)
             (pred_3 ?v12 ?v3)
             (pred_2 ?v2 ?v12 )
	     (pred_5 ?v12)
             (pred_6 ?v7)
             (pred_4 ?v11)
             (pred_11 ?v3)
             (pred_12 ?v12)
             (pred_7 ?v11)
             (pred_9 ?v12)
             (pred_10 ))



(:action op_1
:parameters (?v9 ?v5 ?v6 ?v1)
:precondition (and (pred_6 ?v9) (pred_6 ?v5) (pred_4 ?v6) (pred_11 ?v1)
          (pred_8 ?v9 ?v5) (pred_1 ?v6 ?v1)
                   (pred_3 ?v5 ?v1) (pred_5 ?v9) 
                   (pred_12 ?v5) (pred_7 ?v6))
:effect (and  (pred_9 ?v5) (not (pred_12 ?v5))))


(:action op_5
:parameters (?v9 ?v10)
:precondition (and (pred_6 ?v9) (pred_6 ?v10)
               (pred_5 ?v9) (pred_8 ?v9 ?v10) (pred_9 ?v10))
:effect (and (pred_5 ?v10) (not (pred_5 ?v9))))

(:action op_4
:parameters (?v9 ?v6)
:precondition (and (pred_6 ?v9) (pred_4 ?v6) 
                  (pred_5 ?v9) (pred_2 ?v6 ?v9) (pred_10 ))
:effect (and (pred_7 ?v6)
   (not (pred_2 ?v6 ?v9)) (not (pred_10 ))))


(:action op_2
:parameters (?v9 ?v13 ?v8)
:precondition (and (pred_6 ?v9) (pred_4 ?v13) (pred_4 ?v8)
                  (pred_5 ?v9) (pred_7 ?v8) (pred_2 ?v13 ?v9))
:effect (and (pred_7 ?v13) (pred_2 ?v8 ?v9)
        (not (pred_7 ?v8)) (not (pred_2 ?v13 ?v9))))

(:action op_3
:parameters (?v9 ?v6)
:precondition (and (pred_6 ?v9) (pred_4 ?v6) 
                  (pred_5 ?v9) (pred_7 ?v6))
:effect (and (pred_10 ) (pred_2 ?v6 ?v9) (not (pred_7 ?v6)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_07 obj_09 obj_25 obj_13 obj_24 obj_23 obj_12 obj_30 obj_14 obj_20 obj_28 obj_17 obj_18 obj_27 obj_15 obj_31 obj_29 obj_02 obj_08 obj_26 obj_19 obj_16 obj_04 obj_06 obj_03
    obj_01 obj_11 obj_22
    obj_10 obj_32 obj_21 obj_05
    )

    (:init
       (pred_10)

       (pred_6 obj_07)
       (pred_6 obj_09)
       (pred_6 obj_25)
       (pred_6 obj_13)
       (pred_6 obj_24)
       (pred_6 obj_23)
       (pred_6 obj_12)
       (pred_6 obj_30)
       (pred_6 obj_14)
       (pred_6 obj_20)
       (pred_6 obj_28)
       (pred_6 obj_17)
       (pred_6 obj_18)
       (pred_6 obj_27)
       (pred_6 obj_15)
       (pred_6 obj_31)
       (pred_6 obj_29)
       (pred_6 obj_02)
       (pred_6 obj_08)
       (pred_6 obj_26)
       (pred_6 obj_19)
       (pred_6 obj_16)
       (pred_6 obj_04)
       (pred_6 obj_06)
       (pred_6 obj_03)
       (pred_11 obj_01)
       (pred_11 obj_11)
       (pred_11 obj_22)
       (pred_4 obj_10)
       (pred_4 obj_32)
       (pred_4 obj_21)
       (pred_4 obj_05)

       (pred_8 obj_07 obj_23)
       (pred_8 obj_07 obj_09)
       (pred_8 obj_09 obj_12)
       (pred_8 obj_09 obj_25)
       (pred_8 obj_09 obj_07)
       (pred_8 obj_25 obj_30)
       (pred_8 obj_25 obj_13)
       (pred_8 obj_25 obj_09)
       (pred_8 obj_13 obj_14)
       (pred_8 obj_13 obj_24)
       (pred_8 obj_13 obj_25)
       (pred_8 obj_24 obj_20)
       (pred_8 obj_24 obj_13)
       (pred_8 obj_23 obj_28)
       (pred_8 obj_23 obj_12)
       (pred_8 obj_23 obj_07)
       (pred_8 obj_12 obj_17)
       (pred_8 obj_12 obj_30)
       (pred_8 obj_12 obj_09)
       (pred_8 obj_12 obj_23)
       (pred_8 obj_30 obj_18)
       (pred_8 obj_30 obj_14)
       (pred_8 obj_30 obj_25)
       (pred_8 obj_30 obj_12)
       (pred_8 obj_14 obj_27)
       (pred_8 obj_14 obj_20)
       (pred_8 obj_14 obj_13)
       (pred_8 obj_14 obj_30)
       (pred_8 obj_20 obj_15)
       (pred_8 obj_20 obj_24)
       (pred_8 obj_20 obj_14)
       (pred_8 obj_28 obj_31)
       (pred_8 obj_28 obj_17)
       (pred_8 obj_28 obj_23)
       (pred_8 obj_17 obj_29)
       (pred_8 obj_17 obj_18)
       (pred_8 obj_17 obj_12)
       (pred_8 obj_17 obj_28)
       (pred_8 obj_18 obj_02)
       (pred_8 obj_18 obj_27)
       (pred_8 obj_18 obj_30)
       (pred_8 obj_18 obj_17)
       (pred_8 obj_27 obj_08)
       (pred_8 obj_27 obj_15)
       (pred_8 obj_27 obj_14)
       (pred_8 obj_27 obj_18)
       (pred_8 obj_15 obj_26)
       (pred_8 obj_15 obj_20)
       (pred_8 obj_15 obj_27)
       (pred_8 obj_31 obj_19)
       (pred_8 obj_31 obj_29)
       (pred_8 obj_31 obj_28)
       (pred_8 obj_29 obj_16)
       (pred_8 obj_29 obj_02)
       (pred_8 obj_29 obj_17)
       (pred_8 obj_29 obj_31)
       (pred_8 obj_02 obj_04)
       (pred_8 obj_02 obj_08)
       (pred_8 obj_02 obj_18)
       (pred_8 obj_02 obj_29)
       (pred_8 obj_08 obj_06)
       (pred_8 obj_08 obj_26)
       (pred_8 obj_08 obj_27)
       (pred_8 obj_08 obj_02)
       (pred_8 obj_26 obj_03)
       (pred_8 obj_26 obj_15)
       (pred_8 obj_26 obj_08)
       (pred_8 obj_19 obj_16)
       (pred_8 obj_19 obj_31)
       (pred_8 obj_16 obj_04)
       (pred_8 obj_16 obj_29)
       (pred_8 obj_16 obj_19)
       (pred_8 obj_04 obj_06)
       (pred_8 obj_04 obj_02)
       (pred_8 obj_04 obj_16)
       (pred_8 obj_06 obj_03)
       (pred_8 obj_06 obj_08)
       (pred_8 obj_06 obj_04)
       (pred_8 obj_03 obj_26)
       (pred_8 obj_03 obj_06)
       (pred_12 obj_17)
       (pred_12 obj_07)
       (pred_12 obj_30)
       (pred_12 obj_29)
       (pred_3  obj_17 obj_01)
       (pred_3  obj_07 obj_11)
       (pred_3  obj_30 obj_22)
       (pred_3  obj_29 obj_01)
       (pred_9 obj_09)
       (pred_9 obj_25)
       (pred_9 obj_13)
       (pred_9 obj_24)
       (pred_9 obj_23)
       (pred_9 obj_12)
       (pred_9 obj_14)
       (pred_9 obj_20)
       (pred_9 obj_28)
       (pred_9 obj_18)
       (pred_9 obj_27)
       (pred_9 obj_15)
       (pred_9 obj_31)
       (pred_9 obj_02)
       (pred_9 obj_08)
       (pred_9 obj_26)
       (pred_9 obj_19)
       (pred_9 obj_16)
       (pred_9 obj_04)
       (pred_9 obj_06)
       (pred_9 obj_03)

       (pred_1  obj_10 obj_01)
       (pred_1  obj_32 obj_11)
       (pred_1  obj_21 obj_22)
       (pred_1  obj_05 obj_22)
       (pred_2 obj_10 obj_15)
       (pred_2 obj_32 obj_24)
       (pred_2 obj_21 obj_29)
       (pred_2 obj_05 obj_27)
       (pred_5 obj_28)
    )

    (:goal (and
       (pred_2 obj_05 obj_08)
    ))
(:constraints
  (always (not (pred_5 obj_02)))
)
)

; plan
1. (op_5 obj_28 obj_23)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_23)
   goals met: 0 of 1
2. (op_5 obj_23 obj_12)
   deleted: (pred_5 obj_23)
   added: (pred_5 obj_12)
   goals met: 0 of 1
3. (op_5 obj_12 obj_09)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_09)
   goals met: 0 of 1
4. (op_5 obj_09 obj_25)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_25)
   goals met: 0 of 1
5. (op_5 obj_25 obj_13)
   deleted: (pred_5 obj_25)
   added: (pred_5 obj_13)
   goals met: 0 of 1
6. (op_5 obj_13 obj_14)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_14)
   goals met: 0 of 1
7. (op_5 obj_14 obj_27)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_27)
   goals met: 0 of 1
8. (op_4 obj_27 obj_05)
   deleted: (pred_2 obj_05 obj_27) (pred_10)
   added: (pred_7 obj_05)
   goals met: 0 of 1
9. (op_5 obj_27 obj_08)
   deleted: (pred_5 obj_27)
   added: (pred_5 obj_08)
   goals met: 0 of 1
10. (op_3 obj_08 obj_05)
   deleted: (pred_7 obj_05)
   added: (pred_10) (pred_2 obj_05 obj_08)
   goals met: 1 of 1
